# Homebrew Brewfile
# 使用: brew bundle

# 基础工具
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "openssl"
brew "gnupg"
brew "nmap"

# 终端增强
brew "starship"
brew "lsd"
brew "eza"
brew "bat"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "fd"
brew "delta"
brew "lazygit"
brew "btop"
brew "tlrc"
brew "thefuck"
brew "xh"
brew "zellij"

# 额外现代工具
brew "dust"        # du 替代
brew "duf"         # df 替代
brew "procs"       # ps 替代
brew "sd"          # sed 替代
brew "choose"      # cut 替代
brew "just"        # make 替代

# 开发语言
brew "node"
brew "python"
brew "go"
brew "zig"

# 容器
brew "docker"
brew "kubectl"

# 数据库
brew "postgresql"
brew "redis"
brew "sqlite"

# 编辑器
brew "neovim"

# 媒体
brew "ffmpeg"

# 终端模拟器
cask "ghostty"

# 字体
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
